In [34]:
import numpy as np
import pandas as pd

In [35]:
myData = { 'sushant': [3, 5, np.NaN], 'shreyas':[4, np.NaN, np.NaN], 'tejas':[3, 4, 5] }

In [36]:
myData

{'sushant': [3, 5, nan], 'shreyas': [4, nan, nan], 'tejas': [3, 4, 5]}

In [37]:
myDataFrame = pd.DataFrame(myData)

In [38]:
myDataFrame

   sushant  shreyas  tejas
0      3.0      4.0      3
1      5.0      NaN      4
2      NaN      NaN      5

# Data Cleanup method 1

In [39]:
myDataFrame.dropna()

   sushant  shreyas  tejas
0      3.0      4.0      3

# Data Cleanup method 2

In [40]:
myDataFrame.fillna(value='lco')

  sushant shreyas  tejas
0       3       4      3
1       5     lco      4
2     lco     lco      5

In [41]:
myDataFrame.fillna(value=myDataFrame['sushant'].mean())

   sushant  shreyas  tejas
0      3.0      4.0      3
1      5.0      4.0      4
2      4.0      4.0      5

#  Video 2

In [45]:
newData = {
    'Movies': [ 'Star-Wars', 'Star-Wars', 'Batman', 'Batman', 'Deadpool', 'Deadpool'],
    'Viewers': [ 'sushant', 'shreyas', 'tejas', 'tushar', 'deepak', 'sangram'],
    'Ratings': [10, 7, 6, 9, 8, 5]
}

In [46]:
newData

{'Movies': ['Star-Wars',
  'Star-Wars',
  'Batman',
  'Batman',
  'Deadpool',
  'Deadpool'],
 'Viewers': ['sushant', 'shreyas', 'tejas', 'tushar', 'deepak', 'sangram'],
 'Ratings': [10, 7, 6, 9, 8, 5]}

In [56]:
movieFrame = pd.DataFrame(newData)

In [57]:
movieFrame

      Movies  Viewers  Ratings
0  Star-Wars  sushant       10
1  Star-Wars  shreyas        7
2     Batman    tejas        6
3     Batman   tushar        9
4   Deadpool   deepak        8
5   Deadpool  sangram        5

In [77]:
movieFrame.groupby('Movies').sum().iloc[2]

Ratings    17
Name: Star-Wars, dtype: int64

In [80]:
movieFrame.groupby('Movies').describe()

          Ratings
            count mean      std  min   25%  50%   75%   max
Movies
Batman        2.0  7.5  2.12132  6.0  6.75  7.5  8.25   9.0
Deadpool      2.0  6.5  2.12132  5.0  5.75  6.5  7.25   8.0
Star-Wars     2.0  8.5  2.12132  7.0  7.75  8.5  9.25  10.0